Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/atdf/PIC32CM2532JH01064.atdf
        <register name="ADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="AMOD" caption="Access Mode" mask="0x3"/>
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Length">
          <bitfield name="LENGTH" caption="Length" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Data">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x10" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel n">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x18" rw="R" size="4" initval="0x11060105" caption="Device Identification">
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF" values="DSU_DID__DEVSEL"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF00"/>
          <bitfield name="DIE" caption="Die Number" mask="0xF000"/>
          <bitfield name="SERIES" caption="Series" mask="0x3F0000" values="DSU_DID__SERIES"/>
          <bitfield name="FAMILY" caption="Family" mask="0xF800000" values="DSU_DID__FAMILY"/>
          <bitfield name="PROCESSOR" caption="Processor" mask="0xF0000000" values="DSU_DID__PROCESSOR"/>
        </register>
        <register name="ENTRY0" offset="0x1000" rw="R" size="4" initval="0x9F0FC002" caption="CoreSight ROM Table Entry 0">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY1" offset="0x1004" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Entry 1">
        </register>
        <register name="END" offset="0x1008" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table End">
          <bitfield name="END" caption="End Marker" mask="0xFFFFFFFF"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PID5" offset="0x1FD4" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0x1FD8" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 6">
        </register>
        <register name="PID7" offset="0x1FDC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 7">
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x000000FC" caption="Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x00000009" caption="Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="Component Identification 1">
          <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
          <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="Component Identification 2">
          <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="Component Identification 3">
          <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DSU_DID__FAMILY">
        <value name="2" caption="5V Industrial" value="2"/>
      </value-group>
      <value-group name="DSU_DID__PROCESSOR">
        <value name="1" caption="Cortex-M0+" value="1"/>
      </value-group>
      <value-group name="DSU_DID__SERIES">
        <value name="JH00_JH01" caption="PIC32CM JH00 and PIC32CM JH01" value="6"/>
      </value-group>
      <value-group name="DSU_DID__DEVSEL">
        <value name="512KB_64KB_100PIN_CAN" caption="512 KB Flash / 64 KB SRAM / 100-pin / CAN" value="0x0"/>
        <value name="512KB_64KB_64PIN_CAN" caption="512 KB Flash / 64 KB SRAM / 64-pin / CAN" value="0x1"/>
        <value name="512KB_64KB_48PIN_CAN" caption="512 KB Flash / 64 KB SRAM / 48-pin / CAN" value="0x2"/>
        <value name="512KB_64KB_32PIN_CAN" caption="512 KB Flash / 64 KB SRAM / 32-pin / CAN" value="0x3"/>
        <value name="256KB_32KB_100PIN_CAN" caption="256 KB Flash / 32 KB SRAM / 100-pin / CAN" value="0x4"/>
        <value name="256KB_32KB_64PIN_CAN" caption="256 KB Flash / 32 KB SRAM / 64-pin / CAN" value="0x5"/>
        <value name="256KB_32KB_48PIN_CAN" caption="256 KB Flash / 32 KB SRAM / 48-pin / CAN" value="0x6"/>
        <value name="256KB_32KB_32PIN_CAN" caption="256 KB Flash / 32 KB SRAM / 32-pin / CAN" value="0x7"/>
        <value name="256KB_32KB_100PIN_NOCAN" caption="256 KB Flash / 32 KB SRAM / 100-pin / No CAN" value="0xD"/>
        <value name="512KB_64KB_100PIN_NOCAN" caption="512 KB Flash / 64 KB SRAM / 100-pin / No CAN" value="0xE"/>
        <value name="512KB_64KB_64PIN_NOCAN" caption="512 KB Flash / 64 KB SRAM / 64-pin / No CAN" value="0xF"/>
        <value name="256KB_32KB_64PIN_NOCAN" caption="256 KB Flash / 32 KB SRAM / 64-pin / No CAN" value="0x10"/>
        <value name="256KB_32KB_48PIN_NOCAN" caption="256 KB Flash / 32 KB SRAM / 48-pin / No CAN" value="0x13"/>
        <value name="512KB_64KB_48PIN_NOCAN" caption="512 KB Flash / 64 KB SRAM / 48-pin / No CAN" value="0x14"/>
        <value name="512KB_64KB_32PIN_NOCAN" caption="512 KB Flash / 64 KB SRAM / 32-pin / No CAN" value="0x15"/>
        <value name="256KB_32KB_32PIN_NOCAN" caption="256 KB Flash / 32 KB SRAM / 32-pin / No CAN" value="0x16"/>
      </value-group>
    </module>
    <module name="EIC" id="U2254" version="3.1.0" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKSEL" caption="Clock Selection" mask="0x10" values="EIC_CTRLA__CKSEL"/>
        </register>
        <register name="NMICTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="Non-Maskable Interrupt Control">
          <bitfield name="NMISENSE" caption="Non-Maskable Interrupt Sense Configuration" mask="0x7" values="EIC_NMICTRL__NMISENSE"/>
          <bitfield name="NMIFILTEN" caption="Non-Maskable Interrupt Filter Enable" mask="0x8"/>
          <bitfield name="NMIASYNCH" caption="Asynchronous Edge Detection Mode" mask="0x10" values="EIC_NMICTRL__NMIASYNCH"/>
        </register>
        <register name="NMIFLAG" offset="0x2" rw="RW" size="1" atomic-op="clear:NMIFLAG" initval="0x0000" caption="Non-Maskable Interrupt Flag Status and Clear">
          <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy Status" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy Status" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO0" caption="External Interrupt 0 Event Output Enable" mask="0x1"/>
          <bitfield name="EXTINTEO1" caption="External Interrupt 1 Event Output Enable" mask="0x2"/>
          <bitfield name="EXTINTEO2" caption="External Interrupt 2 Event Output Enable" mask="0x4"/>
          <bitfield name="EXTINTEO3" caption="External Interrupt 3 Event Output Enable" mask="0x8"/>
          <bitfield name="EXTINTEO4" caption="External Interrupt 4 Event Output Enable" mask="0x10"/>
          <bitfield name="EXTINTEO5" caption="External Interrupt 5 Event Output Enable" mask="0x20"/>
          <bitfield name="EXTINTEO6" caption="External Interrupt 6 Event Output Enable" mask="0x40"/>
          <bitfield name="EXTINTEO7" caption="External Interrupt 7 Event Output Enable" mask="0x80"/>
          <bitfield name="EXTINTEO8" caption="External Interrupt 8 Event Output Enable" mask="0x100"/>
          <bitfield name="EXTINTEO9" caption="External Interrupt 9 Event Output Enable" mask="0x200"/>
          <bitfield name="EXTINTEO10" caption="External Interrupt 10 Event Output Enable" mask="0x400"/>
          <bitfield name="EXTINTEO11" caption="External Interrupt 11 Event Output Enable" mask="0x800"/>
          <bitfield name="EXTINTEO12" caption="External Interrupt 12 Event Output Enable" mask="0x1000"/>
          <bitfield name="EXTINTEO13" caption="External Interrupt 13 Event Output Enable" mask="0x2000"/>
          <bitfield name="EXTINTEO14" caption="External Interrupt 14 Event Output Enable" mask="0x4000"/>
          <bitfield name="EXTINTEO15" caption="External Interrupt 15 Event Output Enable" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Enable" mask="0x80"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8 Enable" mask="0x100"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9 Enable" mask="0x200"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10 Enable" mask="0x400"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11 Enable" mask="0x800"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12 Enable" mask="0x1000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13 Enable" mask="0x2000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14 Enable" mask="0x4000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15 Enable" mask="0x8000"/>
        </register>
