Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/atdf/PIC32CM2532JH01064.atdf
      <value-group name="OSCCTRL_OSC48MDIV__DIV">
        <value name="DIV1" caption="48 MHz" value="0"/>
        <value name="DIV2" caption="24 MHz" value="1"/>
        <value name="DIV3" caption="16 MHz" value="2"/>
        <value name="DIV4" caption="12 MHz" value="3"/>
        <value name="DIV5" caption="9.6 MHz" value="4"/>
        <value name="DIV6" caption="8 MHz" value="5"/>
        <value name="DIV7" caption="6.86 MHz" value="6"/>
        <value name="DIV8" caption="6 MHz" value="7"/>
        <value name="DIV9" caption="5.33 MHz" value="8"/>
        <value name="DIV10" caption="4.8 MHz" value="9"/>
        <value name="DIV11" caption="4.36 MHz" value="10"/>
        <value name="DIV12" caption="4 MHz" value="11"/>
        <value name="DIV13" caption="3.69 MHz" value="12"/>
        <value name="DIV14" caption="3.43 MHz" value="13"/>
        <value name="DIV15" caption="3.2 MHz" value="14"/>
        <value name="DIV16" caption="3 MHz" value="15"/>
      </value-group>
      <value-group name="OSCCTRL_OSC48MSTUP__STARTUP">
        <value name="CYCLE8" caption="166 ns" value="0"/>
        <value name="CYCLE16" caption="333 ns" value="1"/>
        <value name="CYCLE32" caption="667 ns" value="2"/>
        <value name="CYCLE64" caption="1.333 us" value="3"/>
        <value name="CYCLE128" caption="2.667 us" value="4"/>
        <value name="CYCLE256" caption="5.333 us" value="5"/>
        <value name="CYCLE512" caption="10.667 us" value="6"/>
        <value name="CYCLE1024" caption="21.333 us" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
        <value name="Default" caption="No time-out. Automatic lock" value="0"/>
        <value name="8MS" caption="Time-out if no lock within 8 ms" value="4"/>
        <value name="9MS" caption="Time-out if no lock within 9 ms" value="5"/>
        <value name="10MS" caption="Time-out if no lock within 10 ms" value="6"/>
        <value name="11MS" caption="Time-out if no lock within 11 ms" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__FILTER">
        <value name="Default" caption="Default Filter Mode" value="0"/>
        <value name="LBFILT" caption="Low Bandwidth Filter" value="1"/>
        <value name="HBFILT" caption="High Bandwidth Filter" value="2"/>
        <value name="HDFILT" caption="High Damping Filter" value="3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
        <value name="XOSC32K" caption="XOSC32K Clock Reference" value="0"/>
        <value name="XOSC" caption="XOSC Clock Reference" value="1"/>
        <value name="GCLK" caption="GCLK Clock Reference" value="2"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLPRESC__PRESC">
        <value name="DIV1" caption="DPLL output is divided by 1" value="0"/>
        <value name="DIV2" caption="DPLL output is divided by 2" value="1"/>
        <value name="DIV4" caption="DPLL output is divided by 4" value="2"/>
      </value-group>
    </module>
    <module name="PAC" id="U2120" version="1.1.0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
          <bitfield name="FLASH_" caption="FLASH" mask="0x1"/>
          <bitfield name="HSRAMCM0P_" caption="SRAM CPU" mask="0x2"/>
          <bitfield name="HSRAMDSU_" caption="SRAM DSU" mask="0x4"/>
          <bitfield name="APBB_" caption="HPB1" mask="0x8"/>
          <bitfield name="APBA_" caption="HPB0" mask="0x10"/>
          <bitfield name="APBC_" caption="HPB2" mask="0x20"/>
          <bitfield name="LPRAMDMAC_" caption="SRAM DMAC" mask="0x40"/>
          <bitfield name="DIVAS_" caption="DIVAS" mask="0x80"/>
          <bitfield name="APBD_" caption="HPB3" mask="0x100"/>
          <bitfield name="HMCRAMCHS_ICM_" caption="SRAM ICM" mask="0x200"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="PM_" caption="PM" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x800"/>
          <bitfield name="MCRAMC_" caption="MCRAMC" mask="0x1000"/>
        </register>
